app/controllers/users_controller.rb

  def show
    @user  = User.find(params[:id])
    @posts = @user.posts.order(created_at: :desc)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]

  def update
    current_user.update(user_params)
---
UPDATE "users" SET "username" = $1, "name" = $2, "website" = $3, "bio" = $4, "gender" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["username", "petergrabbit"], ["name", "Peter Smith"], ["website", "https://petergbsmith.com"], ["bio", ""], ["gender", ""], ["updated_at", "2021-01-13 19:56:03.944502"], ["id", 2]]